(ns ru.lj.alamar.elegraph
  (:require spiral data image util clojure.contrib.math))

(def данные (read-data "data/moscow-2013-09-08/data.csv"))
(def заголовки (first данные))
(def уики (rest данные))

(defn фракции [уик]
  (subvec уик 18))

(def избиратели second)

(defn явка [уик]
  (/ (сумма (фракции уик)) (избиратели уик)))

(def максимальная-явка (apply max (map явка уики)))

(def средняя-явка (/ (сумма (map явка уики)) (count уики)))

(println "Максимальная явка" максимальная-явка)

; Для более равномерного распределения
(defn явка-для-окна [явка]
  (let [разница (- явка средняя-явка)
        модуль (clojure.contrib.math/abs разница)
        сдвиг (Math/pow модуль 0.33)]
    (if (< явка средняя-явка)
      (- 0 сдвиг)
      сдвиг)))

(defn доля-ер [уик]
  (/ (last уик) (сумма (фракции уик))))

(def окно-явки (окно явка-для-окна (map явка уики)))
(def окно-ер (окно identity (map доля-ер уики)))

; 60x80 cm at 300 dpi
(def ширина 6000)
(def высота 8000)

(def высота-графика 6800)
(def высота-полоски 1000)

(def фон (цвет 0xFF 0xFF 0xFF))
(def цвет-сетки (цвет 0xDD 0xDD 0xDD))
(def цвет-цифр (цвет 0x9A 0x9A 0x9A))
(def большая-сетка 5)
(def малая-сетка 3)
(def размер-шрифта 72)

(def холст (create-image ширина высота фон))

(сетка холст ширина высота-графика (/ 1 20) большая-сетка малая-сетка цвет-сетки размер-шрифта цвет-цифр окно-явки окно-ер)

(подписать холст цвет-цифр
  (fn [рисунок]
    (вывести-текст рисунок "программирование, идея — alamar.lj.ru" 72 (/ ширина 2) высота false true)
    (вывести-текст рисунок "Голосование на участках Москвы" 112 3500 350 false false)
    (вывести-текст рисунок "на выборах Мэра Москвы 8 сентября 2013" 72 3500 600 false false)
    (вывести-текст рисунок "явка →" 72 300 65 false false)
    (вывести-текст рисунок "2500 голосов, отданные за кандидатов:" 72 400 5000 false false)
    (вывести-текст рисунок "Дегтярева Михаила Владимировича" 72 400 5200 false false)
    (вывести-текст рисунок "Левичева Николая Владимировича" 72 400 5400 false false)
    (вывести-текст рисунок "Мельникова Ивана Ивановича" 72 400 5600 false false)
    (вывести-текст рисунок "Митрохина Сергея Сергеевича" 72 400 5800 false false)
    (вывести-текст рисунок "Навального Алексея Анатольевича" 72 400 6000 false false)
    (вывести-текст рисунок "Собянина Сергея Семеновича" 72 400 6200 false false)
    (повернуть рисунок)
    (вывести-текст рисунок "доля голосов, отданных Единой России →" 72 200 -380 false false)))

(def шаблон (spiral))

(def цвета-фракций [
            (цвет 0xFF 0xFF 0)    ;; Дегтярев
            (цвет 0x66 0x66 0xCC) ;; Левичев
            (цвет 0xCC 0 0)       ;; Мельников
            (цвет 0x33 0x99 0)    ;; Митрохин
            (цвет 0x9A 0x33 0x9A) ;; Навальный
            (цвет 0 0 0)          ;; Собянин
;;          (цвет 0x33 0x9A 0x9A) ;; Правое Дело
           ])

(образцы холст цвета-фракций 325 5235)

(defn упорядочить-фракции [уик]
  (zip (фракции уик) цвета-фракций))

(defn сортировать-фракции [уик]
  (reverse (sort-by first (упорядочить-фракции уик))))

; (doseq [уик уики]
;   (println (first уик) "явка" (float (явка уик)) "доля Собянина" (float (доля-ер уик))
;     "окно" (float (window-weight (явка-для-окна уик) окно-явки)) (float (window-weight (доля-ер уик) окно-ер))))

(полоска холст высота-графика высота-полоски
  (for [уик уики]
    (let [смещение (int (* ширина (- 1 (окно-явки (явка уик)))))]
      [смещение (упорядочить-фракции уик)])))

(сетка-для-полоски холст ширина высота-графика высота-полоски большая-сетка цвет-сетки (/ 1 20) окно-явки (/ 1 10) (окно identity [0 1]))

(println "Полоска нарисована")

(нанести холст 0 [ширина высота]
  (for [уик (take 4000 уики)]
    (let [смещение
          [(int (* ширина (- 1 (окно-явки (явка уик)))))
           (int (* высота-графика (окно-ер (доля-ер уик))))]]
      [смещение шаблон (сортировать-фракции уик)]))
  [фон цвет-сетки])

(println "Запись изображения")

(save-image холст "mosmer-tst.png")


